address-verification-service/request.xml

<soapenv:Envelope xmlns:dp="http://www.datapower.com/schemas/management" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:date="http://exslt.org/dates-and-times" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.qas.com/OnDemand-2011-03">
   <soapenv:Header/>
   <soapenv:Body>
      <web:QASearch>
         <web:Country>USA</web:Country>
         <web:Engine Flatten="true" Timeout="1000">Verification</web:Engine>
         <web:Layout>RegB layout</web:Layout>
         <web:Search>1001 99th St. E. Seattle WA 98101 USA</web:Search>
      </web:QASearch>
   </soapenv:Body>
</soapenv:Envelope>